src/cfe/Yaxunit/AccumulationRegisters/ОтложенныеВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтложенныеВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументВзаиморасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевозка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Перевозка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cfe/Yaxunit/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевозка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Перевозка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументВзаиморасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cfe/Yaxunit/Documents/РеализацияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Заявка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаОтЗаказчика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Перевозка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Перевозка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаУпр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/Yaxunit/CommonModules/Док_РеализацияУслуг/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
    ЮТТесты.ДобавитьТестовыйНабор("Документ Реализация Услуг: Проверка проведения").ВТранзакции()
		.ДобавитьТест("ПроверкаПроведенияПозитив")
		.ДобавитьТест("ПроверкаПроведенияНегатив") 
		.ДобавитьТест("ПроверкаПроведенияСКонтролемДвижений")
		.ДобавитьТест("ПроверкаОстаткиПоОтложеннымВзаиморасчетамУшлиВНоль")
		.ДобавитьТест("ПроверкаЕстьОстаткиПоВзаиморасчетамСКонтрагентами")
		;

КонецПроцедуры

Процедура ПроверкаПроведенияПозитив() Экспорт
	
	Реализация = ЮТГенерацияДанных.СлучайнаяРеализацияУслуг();
	
	ЮТест.ОжидаетЧто(Реализация.ПолучитьОбъект())  
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)   
		.НеВыбрасываетИсключение()	
		;

КонецПроцедуры

Процедура ПроверкаПроведенияНегатив() Экспорт
	
	Реализация = ЮТГенерацияДанных.СлучайнаяРеализацияУслуг();
	РеализацияОбъект = Реализация.ПолучитьОбъект();
	РеализацияОбъект.Услуги[0].Сумма = РеализацияОбъект.Услуги[0].Сумма + 100; 
	РеализацияОбъект.Записать();	
	
	ЮТест.ОжидаетЧто(РеализацияОбъект)  
		.Метод("Записать",  ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение)) 
		.ВыбрасываетИсключение("Не удалось провести ""Реализация услуг")	
		;
		
	Сообщения = ПолучитьСообщенияПользователю();
	ЮТест.ОжидаетЧто(Сообщения)
		.ИмеетТип("ФиксированныйМассив")
		.ИмеетДлину(1)
		.Свойство("[0].Текст")
			.ИмеетТип("Строка")
			.Содержит("Сумма реализации больше суммы заявок")
		;

КонецПроцедуры

Процедура ПроверкаПроведенияСКонтролемДвижений() Экспорт
	
	Реализация = ЮТГенерацияДанных.СлучайнаяРеализацияУслуг();
	
	ЮТест.ОжидаетЧто(Реализация.ПолучитьОбъект())  
		.Метод("Записать",  ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение)) 
		.НеВыбрасываетИсключение("Не удалось провести ""Реализация услуг")	
		;
		
	ДокОбъект = Реализация.ПолучитьОбъект();;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Для каждого Движ Из ДокОбъект.Движения Цикл
		ЮТест.ОжидаетЧто(Движ.Количество())
			.БольшеИлиРавно(1, "Проверка наличия движений")
		;	
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПроверкаОстаткиПоОтложеннымВзаиморасчетамУшлиВНоль() Экспорт
	
	Реализация = ЮТГенерацияДанных.СлучайнаяРеализацияУслуг();;
	
	ДокОбъект = Реализация.ПолучитьОбъект();;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Дата КАК Период,
	|	Док.Валюта КАК Валюта,
	|	Док.Контрагент КАК Контрагент,
	|	Док.Ссылка КАК Ссылка,
	|	Док.Организация КАК Организация
	|ПОМЕСТИТЬ Док
	|ИЗ
	|	Документ.РеализацияУслуг КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУслуг.Ссылка КАК Ссылка,
	|	ТаблицаУслуг.Услуга КАК Услуга,
	|	ТаблицаУслуг.Сумма КАК Сумма,
	|	ТаблицаУслуг.СуммаУпр КАК СуммаУпр,
	|	ТаблицаУслуг.Перевозка КАК Перевозка,
	|	ТаблицаУслуг.Заявка КАК Заявка
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	Документ.РеализацияУслуг.Услуги КАК ТаблицаУслуг
	|ГДЕ
	|	ТаблицаУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.Валюта КАК Валюта,
	|	Док.Контрагент КАК Контрагент,
	|	Услуги.Перевозка КАК Перевозка,
	|	Услуги.Заявка КАК ДокументВзаиморасчетов,
	|	Док.Организация КАК Организация
	|ПОМЕСТИТЬ ПараметрыДок
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Услуги КАК Услуги
	|		ПО Док.Ссылка = Услуги.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Услуги.Заявка,
	|	Услуги.Перевозка,
	|	Док.Организация,
	|	Док.Контрагент,
	|	Док.Период,
	|	Док.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтложенныеВзаиморасчетыОстатки.Организация КАК Организация,
	|	ОтложенныеВзаиморасчетыОстатки.Контрагент КАК Контрагент,
	|	ОтложенныеВзаиморасчетыОстатки.Перевозка КАК Перевозка,
	|	ОтложенныеВзаиморасчетыОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|	ОтложенныеВзаиморасчетыОстатки.Валюта КАК Валюта,
	|	ОтложенныеВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ОтложенныеВзаиморасчетыОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ОтложенныеВзаиморасчеты.Остатки(
	|			,
	|			(Организация, Контрагент, Перевозка, ДокументВзаиморасчетов, Валюта) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ПараметрыДок.Организация КАК Организация,
	|					ПараметрыДок.Контрагент КАК Контрагент,
	|					ПараметрыДок.Перевозка КАК Перевозка,
	|					ПараметрыДок.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|					ПараметрыДок.Валюта КАК Валюта
	|				ИЗ
	|					ПараметрыДок КАК ПараметрыДок)) КАК ОтложенныеВзаиморасчетыОстатки";
	
	Запрос.УстановитьПараметр("Ссылка", Реализация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
    ЮТест.ОжидаетЧто(РезультатЗапроса.Пустой())
			.Равно(Истина, "Остатоки по запасам ушли в 0")
		;
	
КонецПроцедуры
	
Процедура ПроверкаЕстьОстаткиПоВзаиморасчетамСКонтрагентами() Экспорт
	
	Реализация = ЮТГенерацияДанных.СлучайнаяРеализацияУслуг();;
	
	ДокОбъект = Реализация.ПолучитьОбъект();;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Дата КАК Период,
	|	Док.Валюта КАК Валюта,
	|	Док.Контрагент КАК Контрагент,
	|	Док.Ссылка КАК Ссылка,
	|	Док.Организация КАК Организация
	|ПОМЕСТИТЬ Док
	|ИЗ
	|	Документ.РеализацияУслуг КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУслуг.Ссылка КАК Ссылка,
	|	ТаблицаУслуг.Услуга КАК Услуга,
	|	ТаблицаУслуг.Сумма КАК Сумма,
	|	ТаблицаУслуг.СуммаУпр КАК СуммаУпр,
	|	ТаблицаУслуг.Перевозка КАК Перевозка,
	|	ТаблицаУслуг.Заявка КАК Заявка
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	Документ.РеализацияУслуг.Услуги КАК ТаблицаУслуг
	|ГДЕ
	|	ТаблицаУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Период КАК Период,
	|	Док.Валюта КАК Валюта,
	|	Док.Контрагент КАК Контрагент,
	|	Услуги.Перевозка КАК Перевозка,
	|	Док.Ссылка КАК ДокументВзаиморасчетов,
	|	Док.Организация КАК Организация
	|ПОМЕСТИТЬ ПараметырДок
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Услуги КАК Услуги
	|		ПО Док.Ссылка = Услуги.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиОстатки.Организация КАК Организация,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Перевозка КАК Перевозка,
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Валюта КАК Валюта,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			(Организация, Контрагент, Перевозка, ДокументВзаиморасчетов, Валюта) В
	|				(ВЫБРАТЬ
	|					ПараметырДок.Организация КАК Организация,
	|					ПараметырДок.Контрагент КАК Контрагент,
	|					ПараметырДок.Перевозка КАК Перевозка,
	|					ПараметырДок.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|					ПараметырДок.Валюта КАК Валюта
	|				ИЗ
	|					ПараметырДок КАК ПараметырДок)) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	
	Запрос.УстановитьПараметр("Ссылка", Реализация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
    ЮТест.ОжидаетЧто(РезультатЗапроса.Пустой())
			.Равно(Ложь, "Есть остатки по взаиморасчетам с контрагентами")
		;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
